### YamlMime:AzureCLIGroup
uid: az_sentinel_bookmark
name: az sentinel bookmark
extensionInformation: >-
  > [!Note]

  > Referensi ini adalah bagian dari ekstensi **sentinel** untuk Azure CLI (versi 2.11.0 atau yang lebih tinggi).  Ekstensi akan secara otomatis menginstal saat pertama kali Anda menjalankan perintah **az sentinel bookmark** .  [Pelajari lebih lanjut](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview) tentang ekstensi.
summary: Marka buku Sentinel.
description: ''
directCommands:
- uid: az_sentinel_bookmark_create
  name: az sentinel bookmark create
  summary: Buat bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark create --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  examples:
  - summary: Membuat atau memperbarui marka buku.
    syntax: az sentinel bookmark create --etag "{etag}" --created "2019-01-01T13:15:30Z" --display-name "My bookmark" --labels "Tag1" --labels "Tag2" --notes "Found a suspicious activity" -q "SecurityEvent | where TimeGenerated > ago(1d) and TimeGenerated < ago(2d)" --query-result "Security Event query result" --updated "2019-01-01T13:15:30Z" --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID Bookmark.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama ruang kerja.
    description: ''
  optionalParameters:
  - name: --created
    summary: Waktu bookmark dibuat.
    description: ''
  - name: --display-name
    summary: Nama tampilan bookmark.
    description: ''
  - name: --etag
    summary: Etag sumber daya azure.
    description: ''
  - name: --incident-info
    summary: Menjelaskan insiden yang berkaitan dengan marka buku.
    description: >-
      Penggunaan: --incident-info incident-id=XX severity=XX title=XX relation-name=XX


      incident-id: Diperlukan. Tingkat keparahan Id Insiden: Diperlukan. Tingkat keparahan judul insiden: Diperlukan. Judul nama relasi insiden: Diperlukan. Nama Relasi.
  - name: --labels
    summary: Daftar label yang relevan dengan marka buku ini.
    description: ''
  - name: --notes
    summary: Catatan marka buku.
    description: ''
  - name: --query-result
    summary: Hasil kueri bookmark.
    description: ''
  - name: --updated
    summary: Terakhir kali bookmark diperbarui.
    description: ''
  - name: --updated-by-object-id
    summary: Id objek pengguna.
    description: ''
  - name: -q
    summary: Kueri bookmark.
    description: ''
- uid: az_sentinel_bookmark_delete
  name: az sentinel bookmark delete
  summary: Hapus bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark delete --bookmark-id
                                --resource-group
                                --workspace-name
                                [--yes]
  examples:
  - summary: Menghapus bookmark.
    syntax: az sentinel bookmark delete --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID Bookmark.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama ruang kerja.
    description: ''
  optionalParameters:
  - name: --yes -y
    summary: Jangan meminta konfirmasi.
    description: ''
- uid: az_sentinel_bookmark_list
  name: az sentinel bookmark list
  summary: Mendapatkan semua marka buku.
  description: ''
  syntax: >-
    az sentinel bookmark list --resource-group
                              --workspace-name
  examples:
  - summary: Dapatkan semua marka buku.
    syntax: az sentinel bookmark list --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama ruang kerja.
    description: ''
- uid: az_sentinel_bookmark_show
  name: az sentinel bookmark show
  summary: Mendapatkan bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark show --bookmark-id
                              --resource-group
                              --workspace-name
  examples:
  - summary: Dapatkan bookmark.
    syntax: az sentinel bookmark show --bookmark-id "{id}" --resource-group "myRg" --workspace-name "myWorkspace"
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID Bookmark.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama ruang kerja.
    description: ''
- uid: az_sentinel_bookmark_update
  name: az sentinel bookmark update
  summary: Perbarui bookmark.
  description: ''
  syntax: >-
    az sentinel bookmark update --bookmark-id
                                --resource-group
                                --workspace-name
                                [--created]
                                [--display-name]
                                [--etag]
                                [--incident-info]
                                [--labels]
                                [--notes]
                                [--query-result]
                                [--updated]
                                [--updated-by-object-id]
                                [-q]
  requiredParameters:
  - isRequired: true
    name: --bookmark-id
    summary: ID Bookmark.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama ruang kerja.
    description: ''
  optionalParameters:
  - name: --created
    summary: Waktu bookmark dibuat.
    description: ''
  - name: --display-name
    summary: Nama tampilan bookmark.
    description: ''
  - name: --etag
    summary: Etag sumber daya azure.
    description: ''
  - name: --incident-info
    summary: Menjelaskan insiden yang berkaitan dengan marka buku.
    description: >-
      Penggunaan: --incident-info incident-id=XX severity=XX title=XX relation-name=XX


      incident-id: Diperlukan. Tingkat keparahan Id Insiden: Diperlukan. Tingkat keparahan judul insiden: Diperlukan. Judul nama relasi insiden: Diperlukan. Nama Relasi.
  - name: --labels
    summary: Daftar label yang relevan dengan marka buku ini.
    description: ''
  - name: --notes
    summary: Catatan marka buku.
    description: ''
  - name: --query-result
    summary: Hasil kueri bookmark.
    description: ''
  - name: --updated
    summary: Terakhir kali bookmark diperbarui.
    description: ''
  - name: --updated-by-object-id
    summary: Id objek pengguna.
    description: ''
  - name: -q
    summary: Kueri bookmark.
    description: ''
commands:
- az_sentinel_bookmark_create
- az_sentinel_bookmark_delete
- az_sentinel_bookmark_list
- az_sentinel_bookmark_show
- az_sentinel_bookmark_update
globalParameters:
- name: --debug
  summary: Meningkatkan verbositas pengelogan untuk menampilkan semua log debug.
- name: --help -h
  summary: Menampilkan pesan bantuan ini dan keluar.
- name: --only-show-errors
  summary: Hanya menampilkan kesalahan, menyembunyikan peringatan.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format output.
- name: --query
  summary: String kueri JMESPath. Lihat <a href="http://jmespath.org/">http://jmespath.org/</a> untuk informasi yang lebih lengkap beserta contohnya.
- name: --subscription
  summary: Nama atau ID langganan. Anda dapat mengonfigurasi langganan default menggunakan `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Meningkatkan verbositas pengelogan. Gunakan --debug untuk log waktu lengkap.
metadata:
  description: Marka buku Sentinel.
  ms.openlocfilehash: aa728c257fa11531026e7d6c7428fb3076b3e33d
  ms.sourcegitcommit: 80a188c9ed20b78495059a8a91c7875c5187c69e
  ms.translationtype: MT
  ms.contentlocale: id-ID
  ms.lasthandoff: 03/25/2022
  ms.locfileid: "141076135"
