### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
summary: Mengelola analitik log Azure.
description: ''
directCommands:
- uid: az_monitor_log-analytics_query
  name: az monitor log-analytics query
  summary: Mengkueri ruang kerja Analitik Log.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Jalankan kueri sederhana selama 3,5 hari terakhir.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Menjalankan kueri yang disimpan di ruang kerja
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Kueri untuk dijalankan melalui data Analitik Log.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID Ruang Kerja Analitik Log.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Rentang waktu yang akan dikueri. Default untuk mengkueri semua data yang tersedia.
    description: ''
  - name: --workspaces
    summary: Ruang kerja tambahan untuk menggabungkan data untuk kueri. Tentukan ID ruang kerja tambahan yang dipisahkan oleh spasi.
    description: ''
commands:
- az_monitor_log-analytics_cluster
- az_monitor_log-analytics_cluster_create
- az_monitor_log-analytics_cluster_delete
- az_monitor_log-analytics_cluster_list
- az_monitor_log-analytics_cluster_show
- az_monitor_log-analytics_cluster_update
- az_monitor_log-analytics_cluster_wait
- az_monitor_log-analytics_query
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create
- az_monitor_log-analytics_solution_delete
- az_monitor_log-analytics_solution_list
- az_monitor_log-analytics_solution_show
- az_monitor_log-analytics_solution_update
- az_monitor_log-analytics_workspace
- az_monitor_log-analytics_workspace_create
- az_monitor_log-analytics_workspace_data-export
- az_monitor_log-analytics_workspace_data-export_create
- az_monitor_log-analytics_workspace_data-export_delete
- az_monitor_log-analytics_workspace_data-export_list
- az_monitor_log-analytics_workspace_data-export_show
- az_monitor_log-analytics_workspace_data-export_update
- az_monitor_log-analytics_workspace_delete
- az_monitor_log-analytics_workspace_get-schema
- az_monitor_log-analytics_workspace_get-shared-keys
- az_monitor_log-analytics_workspace_linked-service
- az_monitor_log-analytics_workspace_linked-service_create
- az_monitor_log-analytics_workspace_linked-service_delete
- az_monitor_log-analytics_workspace_linked-service_list
- az_monitor_log-analytics_workspace_linked-service_show
- az_monitor_log-analytics_workspace_linked-service_update
- az_monitor_log-analytics_workspace_linked-service_wait
- az_monitor_log-analytics_workspace_linked-storage
- az_monitor_log-analytics_workspace_linked-storage_add
- az_monitor_log-analytics_workspace_linked-storage_create
- az_monitor_log-analytics_workspace_linked-storage_delete
- az_monitor_log-analytics_workspace_linked-storage_list
- az_monitor_log-analytics_workspace_linked-storage_remove
- az_monitor_log-analytics_workspace_linked-storage_show
- az_monitor_log-analytics_workspace_list
- az_monitor_log-analytics_workspace_list-deleted-workspaces
- az_monitor_log-analytics_workspace_list-management-groups
- az_monitor_log-analytics_workspace_list-usages
- az_monitor_log-analytics_workspace_pack
- az_monitor_log-analytics_workspace_pack_disable
- az_monitor_log-analytics_workspace_pack_enable
- az_monitor_log-analytics_workspace_pack_list
- az_monitor_log-analytics_workspace_recover
- az_monitor_log-analytics_workspace_saved-search
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
- az_monitor_log-analytics_workspace_show
- az_monitor_log-analytics_workspace_table
- az_monitor_log-analytics_workspace_table_create
- az_monitor_log-analytics_workspace_table_delete
- az_monitor_log-analytics_workspace_table_list
- az_monitor_log-analytics_workspace_table_migrate
- az_monitor_log-analytics_workspace_table_restore
- az_monitor_log-analytics_workspace_table_restore_create
- az_monitor_log-analytics_workspace_table_search-job
- az_monitor_log-analytics_workspace_table_search-job_create
- az_monitor_log-analytics_workspace_table_show
- az_monitor_log-analytics_workspace_table_update
- az_monitor_log-analytics_workspace_table_wait
- az_monitor_log-analytics_workspace_update
globalParameters:
- name: --debug
  summary: Meningkatkan verbositas pengelogan untuk menampilkan semua log debug.
- name: --help -h
  summary: Menampilkan pesan bantuan ini dan keluar.
- name: --only-show-errors
  summary: Hanya menampilkan kesalahan, menyembunyikan peringatan.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format output.
- name: --query
  summary: String kueri JMESPath. Lihat <a href="http://jmespath.org/">http://jmespath.org/</a> untuk informasi yang lebih lengkap beserta contohnya.
- name: --subscription
  summary: Nama atau ID langganan. Anda dapat mengonfigurasi langganan default menggunakan `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Meningkatkan verbositas pengelogan. Gunakan --debug untuk log waktu lengkap.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 04/01/2022
  description: Mengelola analitik log Azure.
  ms.openlocfilehash: d8c6e3cbe9508ead07ee808694bd7418a44e82e0
  ms.sourcegitcommit: b2d28cc4e2ccc5aa1a8e7fb3b8ab57ef55b5d4db
  ms.translationtype: MT
  ms.contentlocale: id-ID
  ms.lasthandoff: 04/06/2022
  ms.locfileid: "141468810"
