### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics
name: az monitor log-analytics
extensionInformation: >-
  > [!Note]

  > Referensi ini adalah bagian dari ekstensi **analitik log** untuk Azure CLI (versi 2.0.0 atau yang lebih tinggi).  Ekstensi akan secara otomatis menginstal pertama kali Anda menjalankan perintah **az monitor log-analytics** .  [Pelajari lebih lanjut](https://docs.microsoft.com/en-us/cli/azure/azure-cli-extensions-overview) tentang ekstensi.
summary: Perintah untuk mengkueri data di ruang kerja Analitik Log.
description: ''
directCommands:
- uid: az_monitor_log-analytics_query
  name: az monitor log-analytics query
  summary: Mengkueri ruang kerja Analitik Log.
  description: ''
  syntax: >-
    az monitor log-analytics query --analytics-query
                                   --workspace
                                   [--timespan]
                                   [--workspaces]
  examples:
  - summary: Jalankan kueri sederhana selama 3,5 hari terakhir.
    syntax: az monitor log-analytics query -w workspace-customId --analytics-query "AzureActivity | summarize count() by bin(timestamp, 1h)" -t P3DT12H
  - summary: Menjalankan kueri yang disimpan di ruang kerja
    syntax: >-
      QUERY=$(az monitor log-analytics workspace saved-search show -g resource-group --workspace-name workspace-name -n query-name --query query --output tsv)

      az monitor log-analytics query -w workspace-customId --analytics-query "$QUERY"
  requiredParameters:
  - isRequired: true
    name: --analytics-query
    summary: Kueri untuk dijalankan melalui data Analitik Log.
    description: ''
  - isRequired: true
    name: --workspace -w
    summary: GUID Ruang Kerja Analitik Log.
    description: ''
  optionalParameters:
  - name: --timespan -t
    summary: Rentang waktu yang akan dikueri. Default untuk mengkueri semua data yang tersedia.
    description: ''
  - name: --workspaces
    summary: Ruang kerja tambahan untuk menggabungkan data untuk kueri. Tentukan ID ruang kerja tambahan yang dipisahkan oleh spasi.
    description: ''
commands:
- az_monitor_log-analytics_query
- az_monitor_log-analytics_solution
- az_monitor_log-analytics_solution_create
- az_monitor_log-analytics_solution_delete
- az_monitor_log-analytics_solution_list
- az_monitor_log-analytics_solution_show
- az_monitor_log-analytics_solution_update
globalParameters:
- name: --debug
  summary: Meningkatkan verbositas pengelogan untuk menampilkan semua log debug.
- name: --help -h
  summary: Menampilkan pesan bantuan ini dan keluar.
- name: --only-show-errors
  summary: Hanya menampilkan kesalahan, menyembunyikan peringatan.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format output.
- name: --query
  summary: String kueri JMESPath. Lihat <a href="http://jmespath.org/">http://jmespath.org/</a> untuk informasi yang lebih lengkap beserta contohnya.
- name: --subscription
  summary: Nama atau ID langganan. Anda dapat mengonfigurasi langganan default menggunakan `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Meningkatkan verbositas pengelogan. Gunakan --debug untuk log waktu lengkap.
metadata:
  description: Perintah untuk mengkueri data di ruang kerja Analitik Log.
  ms.openlocfilehash: 60336e86064bb85f499e698e8d2a44df9bdf7969
  ms.sourcegitcommit: 80a188c9ed20b78495059a8a91c7875c5187c69e
  ms.translationtype: MT
  ms.contentlocale: id-ID
  ms.lasthandoff: 03/25/2022
  ms.locfileid: "140949722"
