### YamlMime:AzureCLIGroup
uid: az_monitor_log-analytics_workspace_saved-search
name: az monitor log-analytics workspace saved-search
summary: Kelola pencarian tersimpan untuk ruang kerja analitik log.
description: ''
directCommands:
- uid: az_monitor_log-analytics_workspace_saved-search_create
  name: az monitor log-analytics workspace saved-search create
  summary: Buat pencarian tersimpan untuk ruang kerja tertentu.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search create --category
                                                           --display-name
                                                           --name
                                                           --resource-group
                                                           --saved-query
                                                           --workspace-name
                                                           [--fa]
                                                           [--fp]
                                                           [--tags]
  examples:
  - summary: Buat pencarian tersimpan untuk ruang kerja tertentu.
    syntax: az monitor log-analytics workspace saved-search create -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --category
    summary: Kategori pencarian tersimpan. Ini membantu pengguna menemukan pencarian tersimpan lebih cepat.
    description: ''
  - isRequired: true
    name: --display-name
    summary: Nama tampilan pencarian tersimpan.
    description: ''
  - isRequired: true
    name: --name -n
    summary: Nama pencarian tersimpan dan unik di ruang kerja tertentu.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --saved-query -q
    summary: Ekspresi kueri untuk pencarian tersimpan.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama Ruang Kerja Analitik Log.
    description: ''
  optionalParameters:
  - name: --fa --func-alias
    summary: Alias Fungsi adalah nama pendek yang diberikan ke Pencarian Tersimpan sehingga dapat dengan mudah dirujuk dalam kueri. Mereka diperlukan untuk Grup Komputer.
    description: ''
  - name: --fp --func-param
    summary: "Parameter fungsi opsional jika kueri berfungsi sebagai fungsi. Nilai harus dalam format berikut: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. Untuk contoh lebih lanjut dan sintaks yang tepat, silakan lihat https://docs.microsoft.com/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --tags
    summary: 'Tag yang dipisahkan spasi: key[=value] [key[=value] ...]. Gunakan "" untuk menghapus tag yang ada.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_delete
  name: az monitor log-analytics workspace saved-search delete
  summary: Menghapus pencarian tersimpan untuk ruang kerja tertentu.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search delete --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--yes]
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Nama pencarian tersimpan dan unik di ruang kerja tertentu.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama Ruang Kerja Analitik Log.
    description: ''
  optionalParameters:
  - name: --yes -y
    summary: Jangan meminta konfirmasi.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_list
  name: az monitor log-analytics workspace saved-search list
  summary: Cantumkan semua pencarian tersimpan untuk ruang kerja tertentu.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search list --resource-group
                                                         --workspace-name
  requiredParameters:
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama Ruang Kerja Analitik Log.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_show
  name: az monitor log-analytics workspace saved-search show
  summary: Perlihatkan pencarian tersimpan untuk ruang kerja tertentu.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search show --name
                                                         --resource-group
                                                         --workspace-name
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Nama pencarian tersimpan dan unik di ruang kerja tertentu.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama Ruang Kerja Analitik Log.
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
- uid: az_monitor_log-analytics_workspace_saved-search_update
  name: az monitor log-analytics workspace saved-search update
  summary: Memperbarui pencarian tersimpan untuk ruang kerja tertentu.
  description: ''
  syntax: >-
    az monitor log-analytics workspace saved-search update --name
                                                           --resource-group
                                                           --workspace-name
                                                           [--add]
                                                           [--category]
                                                           [--display-name]
                                                           [--fa]
                                                           [--force-string]
                                                           [--fp]
                                                           [--remove]
                                                           [--saved-query]
                                                           [--set]
                                                           [--tags]
  examples:
  - summary: Memperbarui pencarian tersimpan untuk ruang kerja tertentu.
    syntax: az monitor log-analytics workspace saved-search update -g MyRG --workspace-name MyWS -n MySavedSearch --category Test1 --display-name TestSavedSearch -q "AzureActivity | summarize count() by bin(TimeGenerated, 1h)" --fa myfun --fp "a:string = value"
  requiredParameters:
  - isRequired: true
    name: --name -n
    summary: Nama pencarian tersimpan dan unik di ruang kerja tertentu.
    description: ''
  - isRequired: true
    name: --resource-group -g
    summary: Nama grup sumber daya. Anda dapat mengonfigurasi grup default menggunakan `az configure --defaults group=<name>`.
    description: ''
  - isRequired: true
    name: --workspace-name
    summary: Nama Ruang Kerja Analitik Log.
    description: ''
  optionalParameters:
  - name: --add
    summary: 'Tambahkan objek ke daftar objek dengan menentukan jalur dan pasangan nilai kunci.  Contoh: --add property.listProperty <key=value, string, atau JSON string>.'
    description: ''
  - name: --category
    summary: Kategori pencarian tersimpan. Ini membantu pengguna menemukan pencarian tersimpan lebih cepat.
    description: ''
  - name: --display-name
    summary: Nama tampilan pencarian tersimpan.
    description: ''
  - name: --fa --func-alias
    summary: Alias Fungsi adalah nama pendek yang diberikan ke Pencarian Tersimpan sehingga dapat dengan mudah dirujuk dalam kueri. Mereka diperlukan untuk Grup Komputer.
    description: ''
  - name: --force-string
    summary: Saat menggunakan 'set' atau 'add', pertahankan literal string alih-alih mencoba mengonversi ke JSON.
    description: ''
  - name: --fp --func-param
    summary: "Parameter fungsi opsional jika kueri berfungsi sebagai fungsi. Nilai harus dalam format berikut: 'param-name1:type1 = default_value1, param-name2:type2 = default_value2'. Untuk contoh lebih lanjut dan sintaks yang tepat, silakan lihat https://docs.microsoft.com/azure/kusto/query/functions/user-defined-functions."
    description: ''
  - name: --remove
    summary: 'Hapus properti atau elemen dari daftar.  Contoh: --remove property.list <indexToRemove> OR --remove propertyToRemove.'
    description: ''
  - name: --saved-query -q
    summary: Ekspresi kueri untuk pencarian tersimpan.
    description: ''
  - name: --set
    summary: 'Perbarui objek dengan menentukan jalur properti dan nilai yang akan diatur.  Contoh: --set property1.property2=<value>.'
    description: ''
  - name: --tags
    summary: 'Tag yang dipisahkan spasi: key[=value] [key[=value] ...]. Gunakan "" untuk menghapus tag yang ada.'
    description: ''
  editLink: https://github.com/Azure/azure-cli/blob/dev/src/azure-cli/azure/cli/command_modules/monitor/_help.py
commands:
- az_monitor_log-analytics_workspace_saved-search_create
- az_monitor_log-analytics_workspace_saved-search_delete
- az_monitor_log-analytics_workspace_saved-search_list
- az_monitor_log-analytics_workspace_saved-search_show
- az_monitor_log-analytics_workspace_saved-search_update
globalParameters:
- name: --debug
  summary: Meningkatkan verbositas pengelogan untuk menampilkan semua log debug.
- name: --help -h
  summary: Menampilkan pesan bantuan ini dan keluar.
- name: --only-show-errors
  summary: Hanya menampilkan kesalahan, menyembunyikan peringatan.
- name: --output -o
  defaultValue: json
  parameterValueGroup: json, jsonc, table, tsv
  summary: Format output.
- name: --query
  summary: String kueri JMESPath. Lihat <a href="http://jmespath.org/">http://jmespath.org/</a> untuk informasi yang lebih lengkap beserta contohnya.
- name: --subscription
  summary: Nama atau ID langganan. Anda dapat mengonfigurasi langganan default menggunakan `az account set -s NAME_OR_ID`.
- name: --verbose
  summary: Meningkatkan verbositas pengelogan. Gunakan --debug untuk log waktu lengkap.
metadata:
  doc_source_url_repo: https://github.com/Azure/azure-cli/blob/dev/
  ms.date: 05/18/2022
  description: Kelola pencarian tersimpan untuk ruang kerja analitik log.
  ms.openlocfilehash: 3025576dcb47ac4d8508d521c5596833a274411f
  ms.sourcegitcommit: 3ada8ecc391e1722eb6664a0dcff2bce9fa5cf97
  ms.translationtype: MT
  ms.contentlocale: id-ID
  ms.lasthandoff: 05/24/2022
  ms.locfileid: "145204511"
